jmeter/report-compare/statistics.json
{
  "无索引-暴力匹配全量" : {
    "transaction" : "无索引-暴力匹配全量",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42655.333333333336,
    "medianResTime" : 43798.0,
    "minResTime" : 40144.0,
    "maxResTime" : 44024.0,
    "pct1ResTime" : 44024.0,
    "pct2ResTime" : 44024.0,
    "pct3ResTime" : 44024.0,
    "throughput" : 0.023438415563107932,
    "receivedKBytesPerSec" : 0.007896731805929919,
    "sentKBytesPerSec" : 0.003410472577053791
  },
  "索引-降级推荐验证" : {
    "transaction" : "索引-降级推荐验证",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.333333333333333,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 4.792332268370607,
    "receivedKBytesPerSec" : 19.23952925319489,
    "sentKBytesPerSec" : 0.7300818690095847
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 59,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2188.508474576272,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 44024.0,
    "pct1ResTime" : 299.0,
    "pct2ResTime" : 40144.0,
    "pct3ResTime" : 44024.0,
    "throughput" : 0.4566775546852021,
    "receivedKBytesPerSec" : 1.6611252989689924,
    "sentKBytesPerSec" : 0.06812066543337926
  },
  "索引-重建两级索引" : {
    "transaction" : "索引-重建两级索引",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 305.3333333333333,
    "medianResTime" : 308.0,
    "minResTime" : 299.0,
    "maxResTime" : 309.0,
    "pct1ResTime" : 309.0,
    "pct2ResTime" : 309.0,
    "pct3ResTime" : 309.0,
    "throughput" : 3.225806451612903,
    "receivedKBytesPerSec" : 0.8820564516129031,
    "sentKBytesPerSec" : 0.42527721774193544
  },
  "对比-推荐列表(有索引)" : {
    "transaction" : "对比-推荐列表(有索引)",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.480000000000001,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 7.0,
    "throughput" : 195.3125,
    "receivedKBytesPerSec" : 784.1110229492188,
    "sentKBytesPerSec" : 29.3426513671875
  }
}